Tekla Open API Reference for Tekla Structures 2025
BinaryFilterOperatorType Enumeration
 The binary filter operator type defines the operators between two binary filters.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum BinaryFilterOperatorType
Public Enumeration BinaryFilterOperatorType
Members
Member name | Value | Description
BOOLEAN_OR | 0 |  The Boolean OR operator.
BOOLEAN_AND | 1 |  The Boolean AND operator.
EMPTY | 2 |  The empty operator represents the end of the expression.
See Also
Reference
Tekla.Structures.Filtering Namespace